Revit 2026 API

# MasonryCMU Class

---

A static class that provides access to the property names that appear in the MasonryCMU visual asset schema.

SystemObject Autodesk.Revit.DB.VisualMasonryCMU

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static class MasonryCMU
```
```vb
Public NotInheritable Class MasonryCMU
```
```cpp
public ref class MasonryCMU abstract sealed
```
```fsharp
[<AbstractClassAttribute>]
[<SealedAttribute>]
type MasonryCMU = class end
```

The MasonryCMU type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | CommonTintColor | The property labeled "Tint Color" from the "MasonryCMU" schema. |
|  | CommonTintToggle | The property labeled "Tint" from the "MasonryCMU" schema. |
|  | MasonryCMUApplication | The property labeled "Finish" from the "MasonryCMU" schema. |
|  | MasonryCMUColor | The property labeled "Color" from the "MasonryCMU" schema. |
|  | MasonryCMUColorByObject | The property labeled "Color By Object" from the "MasonryCMU" schema. |
|  | MasonryCMUPattern | The property labeled "Relief Pattern" from the "MasonryCMU" schema. |
|  | MasonryCMUPatternHeight | The property labeled "Amount" from the "MasonryCMU" schema. |
|  | MasonryCMUPatternMap | The property labeled "Image" from the "MasonryCMU" schema. |
|  | MasonryCMUType | The property labeled "Type" from the "MasonryCMU" schema. |

#### Reference

Autodesk.Revit.DB.Visual Namespace